#+TITLE: Emacs Configurations
#+AUTHOR: Ronaldo V. Lobato
#+EMAIL: contact@rvlobato.com
#+OPTIONS: toc:nil num:nil

*** Custom Views

#+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
      '(("d" "Deep Work (Physics & Code Only)"
	 ((tags-todo "code|pipeline|ml|astrophysics|manuscript|bnn"
		     ((org-agenda-overriding-header "🔬 Focused Research Tasks")
		      ;; Bypass super-agenda grouping for a clean, minimalist list
		      (org-super-agenda-groups nil)))))))
#+END_SRC

#+RESULTS:
| d | Deep Work (Physics & Code Only) | ((tags-todo code | pipeline | ml | astrophysics | manuscript | bnn ((org-agenda-overriding-header 🔬 Focused Research Tasks) (org-super-agenda-groups nil)))) |

*** Capture

#+BEGIN_SRC emacs-lisp
;; Location of my default notes file
(setq org-default-notes-file "~/Documents/proton/org/agenda.org")

;; “C-c c” to quickly capture a task/note
(global-set-key (kbd "C-c c") 'org-capture)

;; Your custom scientific capture templates
(setq org-capture-templates
      '(("t" "Todo [General]" entry (file org-default-notes-file)
	 "* TODO %?\n  %i\n  %a")

	("p" "Physics / ML Pipeline Task" entry (file org-default-notes-file)
	 "* TODO %? :pipeline:ml:\n  %i\n  %a")

	("a" "CBPF Admin/Grant Task" entry (file org-default-notes-file)
	 "* TODO %? :cbpf:admin:\n  SCHEDULED: %^t\n  %i\n  %a")

	("l" "Literature to Read" entry (file "~/Documents/proton/org/notes.org")
	 "* TO-READ %? :arxiv:paper:\n  %i\n  %a")))
#+END_SRC

#+RESULTS:
| t | Todo [General] | entry | (file org-default-notes-file) | * TODO %? |

